src/config/InformationRegisters/ПланВыполненияЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>ПланВыполненияЗадач</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаНачалаПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончанияПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Задача</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/config/InformationRegisters/ПланВыполненияЗадач/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Запись.Исполнитель) И ЗначениеЗаполнено(Запись.Задача) Тогда 
		Запись.Исполнитель = Запись.Задача.Исполнитель;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Запись.Период) Тогда 
		Запись.Период = ?(ЗначениеЗаполнено(Запись.ДатаНачалаПлан), Запись.ДатаНачалаПлан, ТекущаяДата());
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Запись.Задача) Тогда 
		Запись.Задача = "";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаПланПриИзменении(Элемент)
	
	Если Запись.ДатаНачалаПлан > Запись.ДатаОкончанияПлан Тогда 
		Запись.ДатаОкончанияПлан = Запись.ДатаНачалаПлан;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НайтиЗадачуНаКлиенте(НомерЗадачи, ОповещатьОбОшибке = Истина)
	
	ЗадачаСсылка = Общий.офПолучитьЗадачуПоНомеру(НомерЗадачи);
	
	Если ЗадачаСсылка <> Неопределено Тогда
		Запись.Задача = ЗадачаСсылка;
	Иначе
		Если ОповещатьОбОшибке Тогда
			Сообщить("Не удалось найти задачу по указанному номеру");
		КонецЕсли;
	КонецЕсли;
	
	ОтобразитьСутьЗадачи();
	
КонецПроцедуры

&НаКлиенте
Процедура НайтиЗадачу(Команда)
	
	НайтиЗадачуНаКлиенте(Запись.Задача);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПриОткрытииНаСервере();
	ОтобразитьСутьЗадачи();
	
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	
	Если Не ЗначениеЗаполнено(Запись.Задача) Тогда 
		Запись.Задача = "";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗадачаОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Запись.Задача = "";
	
	ЗадачаПриИзменении(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗадачаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	НайтиЗадачуНаКлиенте(Текст, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗадачаПриИзменении(Элемент)
	
	ОтобразитьСутьЗадачи();
	
КонецПроцедуры

&НаСервере
Функция ЭтоДокументЗадача()

	Возврат ТипЗнч(Запись.Задача) = Тип("ДокументСсылка.Задача");
		
КонецФункции

&НаСервере
Функция ПолучитьСутьЗадачи()
		
	Возврат СокрЛП(Запись.Задача.Суть);
	
КонецФункции


&НаКлиенте
Процедура ОтобразитьСутьЗадачи()
	
	Если ЭтоДокументЗадача() Тогда
		Элементы.СутьЗадачи.Видимость = Истина;
		СутьЗадачи = ПолучитьСутьЗадачи();
	Иначе 
		Элементы.СутьЗадачи.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры
